#include QMK_KEYBOARD_H
#include "bootloader.h"
#ifdef PROTOCOL_LUFA
    #include "lufa.h"
    #include "split_util.h"
#endif
#ifdef SSD1306OLED
    #include "ssd1306.h"
#endif

extern keymap_config_t keymap_config;

extern uint8_t is_master;

// layers ----------------------------------------------------------------------

#define LY_CLMK 0
#define LY_QWER 1
#define LY_GAME 2
#define LY_FN1  3
#define LY_FN2  4
#define LY_FN3  5

// special key shortcuts -------------------------------------------------------

#define SP_CTTB CTL_T(KC_TAB)        // tab or left control when held
#define SP_CTEN CTL_T(KC_ENT)        // enter or left control when held
#define SP_SPSH MT(MOD_LSFT, KC_SPC) // space or left shift when held
#define SP_ESGA TD(TD_ESC_GAME)      // esc or gaming layout when tapped twice
#define SP_FN3  TT(LY_FN3)           // lock the FN3 layer when tapped twice

// tap dance -------------------------------------------------------------------

enum {
  TD_ESC_GAME = 0
};

qk_tap_dance_action_t tap_dance_actions[] = {
  // tap once for ESC, twice to enable the gaming layout
  [TD_ESC_GAME] = ACTION_TAP_DANCE_LAYER_TOGGLE(KC_ESC, LY_GAME)
};

// layouts ---------------------------------------------------------------------

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

    /* colemak mod DHm
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤  F  ├─────┐                          ┌─────┤  U  ├─────┐
     * ┌─────┬─────┤  W  ├─────┤  P  ├─────┐              ┌─────┤  L  ├─────┤  Y  ├─────┬─────┐
     * │ esc │  Q  ├─────┤  S  ├─────┤  B  │              │  J  ├─────┤  E  ├─────┤  ;  │ bsp │
     * ├─────┼─────┤  R  ├─────┤  T  ├─────┤              ├─────┤  N  ├─────┤  I  ├─────┼─────┤
     * │ tab │  A  ├─────┤  C  ├─────┤  G  │              │  M  ├─────┤  ,  ├─────┤  O  │enter│
     * ├─────┼─────┤  X  ├─────┤  D  ├─────┤              ├─────┤  H  ├─────┤  .  ├─────┼─────┤
     * │ gui │  Z  ├─────┘     └─────┤  V  │              │  K  ├─────┘     └─────┤  /  | alt │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │ fn3 │┌─────┐┌─────┐    ┌─────┐┌─────┐│ctrl │
     *                      └─────┘│ fn1 ││shift│    │space││ fn2 │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_CLMK] = LAYOUT( \
    SP_ESGA, KC_Q, KC_W, KC_F,  KC_P, KC_B,                  KC_J,   KC_L,       KC_U,    KC_Y,   KC_SCLN, KC_BSPC, \
    KC_TAB,  KC_A, KC_R, KC_S,  KC_T, KC_G,                  KC_M,   KC_N,       KC_E,    KC_I,   KC_O,    KC_ENT, \
    KC_LGUI, KC_Z, KC_X, KC_C,  KC_D, KC_V,                  KC_K,   KC_H,       KC_COMM, KC_DOT, KC_SLSH, KC_LALT, \
                        SP_FN3, MO(LY_FN1), KC_LSFT,         KC_SPC, MO(LY_FN2), KC_LCTRL \
    ),

    /* qwerty
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤  E  ├─────┐                          ┌─────┤  I  ├─────┐
     * ┌─────┬─────┤  W  ├─────┤  R  ├─────┐              ┌─────┤  U  ├─────┤  O  ├─────┬─────┐
     * │ esc │  Q  ├─────┤  D  ├─────┤  T  │              │  Y  ├─────┤  K  ├─────┤  P  │ bsp │
     * ├─────┼─────┤  S  ├─────┤  F  ├─────┤              ├─────┤  J  ├─────┤  L  ├─────┼─────┤
     * │ tab │  A  ├─────┤  C  ├─────┤  G  │              │  H  ├─────┤  ,  ├─────┤  ;  │enter│
     * ├─────┼─────┤  X  ├─────┤  V  ├─────┤              ├─────┤  M  ├─────┤  .  ├─────┼─────┤
     * │ gui │  Z  ├─────┘     └─────┤  B  │              │  N  ├─────┘     └─────┤  /  | alt │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │ fn3 │┌─────┐┌─────┐    ┌─────┐┌─────┐│ctrl │
     *                      └─────┘│ fn1 ││shift│    │space││ fn2 │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_QWER] = LAYOUT( \
    SP_ESGA, KC_Q, KC_W, KC_E,   KC_R, KC_T,                  KC_Y,   KC_U,       KC_I,    KC_O,   KC_P,    KC_BSPC, \
    KC_TAB,  KC_A, KC_S, KC_D,   KC_F, KC_G,                  KC_H,   KC_J,       KC_K,    KC_L,   KC_SCLN, SP_CTEN, \
    KC_LGUI, KC_Z, KC_X, KC_C,   KC_V, KC_B,                  KC_N,   KC_M,       KC_COMM, KC_DOT, KC_SLSH, KC_LALT, \
                         SP_FN3, MO(LY_FN1), KC_LSFT,         KC_SPC, MO(LY_FN2), KC_LCTRL \
    ),

    /* gaming "layer mask"
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤     ├─────┐                          ┌─────┤     ├─────┐
     * ┌─────┬─────┤     ├─────┤     ├─────┐              ┌─────┤     ├─────┤     ├─────┬─────┐
     * │ esc │     ├─────┤     ├─────┤     │              │     ├─────┤     ├─────┤     │ bsp │
     * ├─────┼─────┤     ├─────┤     ├─────┤              ├─────┤     ├─────┤     ├─────┼─────┤
     * │tb/ct│     ├─────┤     ├─────┤     │              │     ├─────┤     ├─────┤     │enter│
     * ├─────┼─────┤     ├─────┤     ├─────┤              ├─────┤     ├─────┤     ├─────┼─────┤
     * │shift│     ├─────┘     └─────┤     │              │     ├─────┘     └─────┤     │ fn3 │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │ alt │┌─────┐┌─────┐    ┌─────┐┌─────┐│ gui │
     *                      └─────┘│space││ fn1 │    │space││ fn2 │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_GAME] = LAYOUT( \
    SP_ESGA, _______, _______, _______, _______, _______,           _______, _______,    _______, _______, _______, KC_BSPC, \
    SP_CTTB, _______, _______, _______, _______, _______,           _______, _______,    _______, _______, _______, KC_ENT, \
    KC_LSFT, _______, _______, _______, _______, _______,           _______, _______,    _______, _______, _______, MO(LY_FN3), \
                               KC_LALT, KC_SPC,  MO(LY_FN1),        KC_SPC,  MO(LY_FN2), KC_LGUI \
    ),

    /* fn1 - symbols
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤  #  ├─────┐                          ┌─────┤  *  ├─────┐
     * ┌─────┬─────┤  @  ├─────┤  $  ├─────┐              ┌─────┤  &  ├─────┤  (  ├─────┬─────┐
     * │  ~  │  !  ├─────┤  +  ├─────┤  %  │              │  ^  ├─────┤  -  ├─────┤  )  │ del │
     * ├─────┼─────┤  =  ├─────┤  {  ├─────┤              ├─────┤  }  ├─────┤  _  ├─────┼─────┤
     * │     │  '  ├─────┤     ├─────┤  "  │              │  |  ├─────┤     ├─────┤  `  │     │
     * ├─────┼─────┤     ├─────┤  [  ├─────┤              ├─────┤  ]  ├─────┤     ├─────┼─────┤
     * │     │     ├─────┘     └─────┤     │              │     ├─────┘     └─────┤  \  │     │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │     │┌─────┐┌─────┐    ┌─────┐┌─────┐│     │
     *                      └─────┘│     ││     │    │     ││     │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_FN1] = LAYOUT( \
    KC_TILD, KC_EXLM, KC_AT,    KC_HASH, KC_DLR,  KC_PERC,        KC_CIRC, KC_AMPR, KC_ASTR, KC_LPRN, KC_RPRN, KC_DEL, \
    _______, KC_QUOT, KC_EQUAL, KC_PLUS, KC_LCBR, KC_DQT,         KC_PIPE, KC_RCBR,  KC_MINS, KC_UNDS, KC_GRV, _______, \
    _______, XXXXXXX, XXXXXXX,  XXXXXXX, KC_LBRC, XXXXXXX,        XXXXXXX, KC_RBRC, XXXXXXX, XXXXXXX, KC_BSLS, _______, \
                                _______, _______, _______,        _______, _______, _______ \
    ),

    /* fn2 - navigation and media functions
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤ F4  ├─────┐                          ┌─────┤ F9  ├─────┐
     * ┌─────┬─────┤ F3  ├─────┤ F5  ├─────┐              ┌─────┤ F8  ├─────┤ F10 ├─────┬─────┐
     * │ F1  │ F2  ├─────┤     ├─────┤ F6  │              │ F7  ├─────┤down ├─────┤ F11 │ F12 │
     * ├─────┼─────┤     ├─────┤ctrl ├─────┤              ├─────┤left ├─────┤ up  ├─────┼─────┤
     * │     │     ├─────┤next ├─────┤     │              │home ├─────┤pgdwn├─────┤right│     │
     * ├─────┼─────┤prev ├─────┤     ├─────┤              ├─────┤ end ├─────┤pgup ├─────┼─────┤
     * │     │play ├─────┘     └─────┤     │              │     ├─────┘     └─────┤shift│ptscr│
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │     │┌─────┐┌─────┐    ┌─────┐┌─────┐│     │
     *                      └─────┘│     ││     │    │     ││     │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_FN2] = LAYOUT( \
    KC_F1,   KC_F2,   KC_F3,   KC_F4,   KC_F5,    KC_F6,          KC_F7,   KC_F8,   KC_F9,   KC_F10,  KC_F11,  KC_F12, \
    _______, XXXXXXX, XXXXXXX, XXXXXXX, KC_LCTRL, XXXXXXX,        KC_HOME, KC_LEFT, KC_DOWN, KC_UP,   KC_RGHT, _______, \
    _______, KC_MPLY, KC_MPRV, KC_MNXT, XXXXXXX,  XXXXXXX,        XXXXXXX, KC_END,  KC_PGDN, KC_PGUP, KC_LSFT, KC_PSCREEN, \
                               _______, _______,  _______,        _______, _______, _______ \
    ),

    /* fn3 - numbers & special keys
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤     ├─────┐                          ┌─────┤  8  ├─────┐
     * ┌─────┬─────┤     ├─────┤     ├─────┐              ┌─────┤  7  ├─────┤  9  ├─────┬─────┐
     * │reset│     ├─────┤     ├─────┤colmk│              │     ├─────┤  5  ├─────┤     │     │
     * ├─────┼─────┤     ├─────┤     ├─────┤              ├─────┤  4  ├─────┤  6  ├─────┼─────┤
     * │     │     ├─────┤     ├─────┤qwert│              │     ├─────┤  2  ├─────┤  .  │     │
     * ├─────┼─────┤     ├─────┤     ├─────┤              ├─────┤  1  ├─────┤  3  ├─────┼─────┤
     * │     │     ├─────┘     └─────┤     │              │     ├─────┘     └─────┤     │     │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │     │┌─────┐┌─────┐    ┌─────┐┌─────┐│     │
     *                      └─────┘│     ││     │    │  0  ││     │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_FN3] = LAYOUT( \
    RESET,   XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, DF(LY_CLMK),         XXXXXXX, KC_7,    KC_8,   KC_9, XXXXXXX, _______, \
    _______, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, DF(LY_QWER),         XXXXXXX, KC_4,    KC_5,   KC_6, KC_DOT,  _______, \
    _______, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX,             XXXXXXX, KC_1,    KC_2,   KC_3, XXXXXXX, _______, \
                               _______, _______, _______,             KC_0 ,   _______, _______ \
    )
};

// misc ------------------------------------------------------------------------

void persistent_default_layer_set(uint16_t default_layer) {
    eeconfig_update_default_layer(default_layer);
    default_layer_set(default_layer);
}

void matrix_init_user(void) {
    persistent_default_layer_set(1UL<<LY_CLMK); // set the default
    #ifdef SSD1306OLED
        iota_gfx_init(!has_usb()); // turns on the display
    #endif
}

// SSD1306 OLED screen ---------------------------------------------------------

#ifdef SSD1306OLED
    const char *read_default_layer_state(void);
    const char *read_layer_state(void);
    const char *read_logo(void);

    void matrix_scan_user(void) {
       iota_gfx_task();
    }

    void matrix_render_user(struct CharacterMatrix *matrix) {
        if (is_master) {
            matrix_write_ln(matrix, read_default_layer_state());
            matrix_write_ln(matrix, read_layer_state());
        } else {
            matrix_write(matrix, read_logo());
        }
    }

    void matrix_update(struct CharacterMatrix *dest, const struct CharacterMatrix *source) {
        if (memcmp(dest->display, source->display, sizeof(dest->display))) {
            memcpy(dest->display, source->display, sizeof(dest->display));
            dest->dirty = true;
        }
    }

    void iota_gfx_task_user(void) {
        struct CharacterMatrix matrix;
        matrix_clear(&matrix);
        matrix_render_user(&matrix);
        matrix_update(&display, &matrix);
    }
#endif
