#include QMK_KEYBOARD_H
#include "bootloader.h"
#ifdef PROTOCOL_LUFA
    #include "lufa.h"
    #include "split_util.h"
#endif
#ifdef SSD1306OLED
    #include "ssd1306.h"
#endif

extern keymap_config_t keymap_config;

extern uint8_t is_master;

// layers ----------------------------------------------------------------------

#define LY_CLMK 0
#define LY_GAME 1
#define LY_FN1  2
#define LY_FN2  3
#define LY_FN3  4

// special key shortcuts -------------------------------------------------------

#define CUT     LCTL(KC_X)
#define COPY    LCTL(KC_C)
#define PASTE   LCTL(KC_V)
#define UNDO    LCTL(KC_Z)
#define SP_GAME TG(LY_GAME)          // toggles the "gaming" layer
#define SP_CTTB CTL_T(KC_TAB)        // tab or left control when held
#define SP_CTEN CTL_T(KC_ENT)        // enter or left control when held
#define SP_SPSH MT(MOD_LSFT, KC_SPC) // space or left shift when held
#define SP_LY01 MO(LY_FN1)
#define SP_LY02 MO(LY_FN2)
#define SP_LY03 MO(LY_FN3)

// layouts ---------------------------------------------------------------------

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

    /* colemak mod DHm
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤  F  ├─────┐                          ┌─────┤  U  ├─────┐
     * ┌─────┬─────┤  W  ├─────┤  P  ├─────┐              ┌─────┤  L  ├─────┤  Y  ├─────┬─────┐
     * │ esc │  Q  ├─────┤  S  ├─────┤  B  │              │  J  ├─────┤  E  ├─────┤  ;  │ bsp │
     * ├─────┼─────┤  R  ├─────┤  T  ├─────┤              ├─────┤  N  ├─────┤  I  ├─────┼─────┤
     * │ tab │  A  ├─────┤  C  ├─────┤  G  │              │  M  ├─────┤  ,  ├─────┤  O  │enter│
     * ├─────┼─────┤  X  ├─────┤  D  ├─────┤              ├─────┤  H  ├─────┤  .  ├─────┼─────┤
     * │ gui │  Z  ├─────┘     └─────┤  V  │              │  K  ├─────┘     └─────┤  /  │ alt │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │ fn3 │┌─────┐┌─────┐    ┌─────┐┌─────┐│ctrl │
     *                      └─────┘│ fn1 ││shift│    │space││ fn2 │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_CLMK] = LAYOUT( \
    KC_ESC,  KC_Q, KC_W, KC_F,    KC_P,    KC_B,    KC_J,   KC_L,    KC_U,    KC_Y,   KC_SCLN, KC_BSPC, \
    KC_TAB,  KC_A, KC_R, KC_S,    KC_T,    KC_G,    KC_M,   KC_N,    KC_E,    KC_I,   KC_O,    KC_ENT, \
    KC_LGUI, KC_Z, KC_X, KC_C,    KC_D,    KC_V,    KC_K,   KC_H,    KC_COMM, KC_DOT, KC_SLSH, KC_LALT, \
                         SP_LY03, SP_LY01, KC_LSFT, KC_SPC, SP_LY02, KC_LCTRL \
    ),

    /* gaming "layer mask"
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤     ├─────┐                          ┌─────┤     ├─────┐
     * ┌─────┬─────┤     ├─────┤     ├─────┐              ┌─────┤     ├─────┤     ├─────┬─────┐
     * │ esc │     ├─────┤     ├─────┤     │              │     ├─────┤     ├─────┤     │ bsp │
     * ├─────┼─────┤     ├─────┤     ├─────┤              ├─────┤     ├─────┤     ├─────┼─────┤
     * │ tab │     ├─────┤     ├─────┤     │              │     ├─────┤     ├─────┤     │enter│
     * ├─────┼─────┤     ├─────┤     ├─────┤              ├─────┤     ├─────┤     ├─────┼─────┤
     * │shift│     ├─────┘     └─────┤     │              │     ├─────┘     └─────┤     │ gui │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │ctrl │┌─────┐┌─────┐    ┌─────┐┌─────┐│ fn3 │
     *                      └─────┘│space││ fn1 │    │sp/sh││ fn2 │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_GAME] = LAYOUT( \
    KC_ESC,  _______, _______, _______,  _______, _______, _______, _______, _______, _______, _______, KC_BSPC, \
    KC_TAB,  _______, _______, _______,  _______, _______, _______, _______, _______, _______, _______, KC_ENT, \
    KC_LSFT, _______, _______, _______,  _______, _______, _______, _______, _______, _______, _______, KC_LGUI, \
                               KC_LCTRL, KC_SPC,  SP_LY01, SP_SPSH, SP_LY02, SP_LY03 \
    ),

    /* fn1 - symbols
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤  #  ├─────┐                          ┌─────┤  *  ├─────┐
     * ┌─────┬─────┤  @  ├─────┤  $  ├─────┐              ┌─────┤  &  ├─────┤  (  ├─────┬─────┐
     * │  ~  │  !  ├─────┤  +  ├─────┤  %  │              │  ^  ├─────┤  -  ├─────┤  )  │ del │
     * ├─────┼─────┤  =  ├─────┤  {  ├─────┤              ├─────┤  }  ├─────┤  _  ├─────┼─────┤
     * │     │  '  ├─────┤copy ├─────┤  "  │              │  |  ├─────┤  €  ├─────┤  `  │     │
     * ├─────┼─────┤ cut ├─────┤  [  ├─────┤              ├─────┤  ]  ├─────┤     ├─────┼─────┤
     * │menu │undo ├─────┘     └─────┤paste│              │     ├─────┘     └─────┤  \  │     │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │     │┌─────┐┌─────┐    ┌─────┐┌─────┐│     │
     *                      └─────┘│     ││     │    │     ││     │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_FN1] = LAYOUT( \
    KC_TILD, KC_EXLM, KC_AT,    KC_HASH, KC_DLR,  KC_PERC, KC_CIRC, KC_AMPR, KC_ASTR,    KC_LPRN, KC_RPRN, KC_DEL, \
    _______, KC_QUOT, KC_EQUAL, KC_PLUS, KC_LCBR, KC_DQT,  KC_PIPE, KC_RCBR, KC_MINS,    KC_UNDS, KC_GRV,  _______, \
    KC_APP,  UNDO,    CUT,      COPY,    KC_LBRC, PASTE,   XXXXXXX, KC_RBRC, RALT(KC_5), XXXXXXX, KC_BSLS, _______, \
                                _______, _______, _______, _______, _______, _______ \
    ),

    /* fn2 - navigation and function keys
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤ F4  ├─────┐                          ┌─────┤ F9  ├─────┐
     * ┌─────┬─────┤ F3  ├─────┤ F5  ├─────┐              ┌─────┤ F8  ├─────┤ F10 ├─────┬─────┐
     * │ F1  │ F2  ├─────┤     ├─────┤ F6  │              │ F7  ├─────┤down ├─────┤ F11 │ F12 │
     * ├─────┼─────┤     ├─────┤ctrl ├─────┤              ├─────┤left ├─────┤ up  ├─────┼─────┤
     * │     │     ├─────┤     ├─────┤     │              │home ├─────┤pgdwn├─────┤right│     │
     * ├─────┼─────┤     ├─────┤     ├─────┤              ├─────┤ end ├─────┤pgup ├─────┼─────┤
     * │     │     ├─────┘     └─────┤ptscr│              │     ├─────┘     └─────┤     │     │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │     │┌─────┐┌─────┐    ┌─────┐┌─────┐│     │
     *                      └─────┘│     ││     │    │     ││     │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_FN2] = LAYOUT( \
    KC_F1,   KC_F2,   KC_F3,   KC_F4,   KC_F5,    KC_F6,      KC_F7,   KC_F8,   KC_F9,   KC_F10,  KC_F11,  KC_F12, \
    _______, XXXXXXX, XXXXXXX, XXXXXXX, KC_LCTRL, XXXXXXX,    KC_HOME, KC_LEFT, KC_DOWN, KC_UP,   KC_RGHT, _______, \
    _______, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX,  KC_PSCREEN, XXXXXXX, KC_END,  KC_PGDN, KC_PGUP, XXXXXXX, _______, \
                               _______, _______,  _______,    _______, _______, _______ \
    ),

    /* fn3 - numbers and media
     *                   ┌─────┐                                      ┌─────┐
     *             ┌─────┤     ├─────┐                          ┌─────┤  8  ├─────┐
     * ┌─────┬─────┤     ├─────┤     ├─────┐              ┌─────┤  7  ├─────┤  9  ├─────┬─────┐
     * │ OFF │     ├─────┤prev ├─────┤game │              │     ├─────┤  5  ├─────┤  -  │     │
     * ├─────┼─────┤play ├─────┤next ├─────┤              ├─────┤  4  ├─────┤  6  ├─────┼─────┤
     * │     │     ├─────┤vol- ├─────┤     │              │     ├─────┤  2  ├─────┤  .  │     │
     * ├─────┼─────┤mute ├─────┤vol+ ├─────┤              ├─────┤  1  ├─────┤  3  ├─────┼─────┤
     * │ ON  │     ├─────┘     └─────┤     │              │     ├─────┘     └─────┤  0  │     │
     * └─────┴─────┘        ┌─────┐  └─────┘              └─────┘  ┌─────┐        └─────┴─────┘
     *                      │     │┌─────┐┌─────┐    ┌─────┐┌─────┐│     │
     *                      └─────┘│     ││     │    │  0  ││     │└─────┘
     *                             └─────┘└─────┘    └─────┘└─────┘
     */
    [LY_FN3] = LAYOUT( \
    _______, XXXXXXX, XXXXXXX, XXXXXXX, XXXXXXX, SP_GAME, XXXXXXX, KC_7,    KC_8,   KC_9, KC_MINS, _______, \
    _______, XXXXXXX, KC_MPLY, KC_MPRV, KC_MNXT, XXXXXXX, XXXXXXX, KC_4,    KC_5,   KC_6, KC_DOT,  _______, \
    _______, XXXXXXX, KC_MUTE, KC_VOLD, KC_VOLU, XXXXXXX, XXXXXXX, KC_1,    KC_2,   KC_3, KC_0,    _______, \
                               _______, _______, _______, KC_0 ,   _______, _______ \
    )
};

// misc ------------------------------------------------------------------------

void persistent_default_layer_set(uint16_t default_layer) {
    eeconfig_update_default_layer(default_layer);
    default_layer_set(default_layer);
}

void matrix_init_user(void) {
    persistent_default_layer_set(1UL<<LY_CLMK); // set the default
    #ifdef SSD1306OLED
        iota_gfx_init(!has_usb()); // turns on the display
    #endif
}

// SSD1306 OLED screen ---------------------------------------------------------

#ifdef SSD1306OLED
    const char *read_default_layer_state(void);
    const char *read_layer_state(void);
    const char *read_logo(void);

    void matrix_scan_user(void) {
       iota_gfx_task();
    }

    void matrix_render_user(struct CharacterMatrix *matrix) {
        if (is_master) {
            matrix_write_ln(matrix, read_default_layer_state());
            matrix_write_ln(matrix, read_layer_state());
        } else {
            matrix_write(matrix, read_logo());
        }
    }

    void matrix_update(struct CharacterMatrix *dest, const struct CharacterMatrix *source) {
        if (memcmp(dest->display, source->display, sizeof(dest->display))) {
            memcpy(dest->display, source->display, sizeof(dest->display));
            dest->dirty = true;
        }
    }

    void iota_gfx_task_user(void) {
        struct CharacterMatrix matrix;
        matrix_clear(&matrix);
        matrix_render_user(&matrix);
        matrix_update(&display, &matrix);
    }
#endif
